openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlameSolids/0/solid2/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid2";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    maxY
    {
        type            calculated;
        value           uniform 100000;
    }
    maxX
    {
        type            calculated;
        value           uniform 100000;
    }
    minY
    {
        type            calculated;
        value           uniform 100000;
    }
    minZ
    {
        type            calculated;
        value           uniform 100000;
    }
    maxZ
    {
        type            calculated;
        value           uniform 100000;
    }
    solid2_to_solid1
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
