openFoam/heatTransfer/chtMultiRegionFoam/infinitelyFastFlameSolids/0/solid2/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid2";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 660;

boundaryField
{
    maxY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxX
    {
        type            fixedValue;
        value           uniform 660;
    }
    minY
    {
        type            zeroGradient;
        value           uniform 300;
    }
    minZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    maxZ
    {
        type            zeroGradient;
        value           uniform 300;
    }
    solid2_to_solid1
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 0;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
}


// ************************************************************************* //
